{
    "header": {
        "index": "Home",
        "about": "About",
        "experience": "Exp",
        "skills": "Skills",
        "projects": "Projects"
    },
    "about": {
        "title": "About",
        "introduce": "I am a front-end developer with one year of hands-on experience, proficient in modern web development using Vue 3. I am currently learning React to broaden my front-end skill set and move toward a more full-stack capability. I have participated in projects such as real-time chat systems, interactive 3D web pages, and multilingual applications."
    },
    "experience": {
        "title": "Experience",
        "content": [
            {
                "company": "Tyche Tech",
                "introduce": "**Payment Software Maintenance (Vue2)**: Responsible for maintaining the already-launched payment software, ensuring the system runs stably, and performing necessary feature optimizations and performance improvements.\n**Real-time Chat Software Development (Vue3)**: Developing a real-time chat application based on Vue3, integrating WebSocket technology to implement real-time communication features, ensuring efficient user interaction.\n**Dynamic 3D Page Design**: Using Three.js to design dynamic and interactive 3D pages to enhance user experience.\n**Multilingual Support (i18n)**:  Implementing multilingual translation of the application using i18n technology to meet the needs of global users."
            },
            {
                "company": "Self-Learning",
                "introduce": "I have deeply studied multiple modern front-end technologies through self-learning, including TypeScript, Vue 3, Nuxt 3, and other frameworks. I also combined tools like Sass and Tailwind CSS to create responsive and highly maintainable websites. During the learning process, I practiced backend technologies through Firebase, which enhanced my full-stack development capabilities."
            },
            {
                "company": "Front-End Web Design and Programming Technical Practice Course",
                "introduce": "Through the training in the in-service program, I gained a deep understanding of the basics of front-end development, from HTML, CSS to JavaScript and jQuery. I also learned how to use Bootstrap for rapid prototyping."
            }
        ]
    },
    "skill": {
        "title": "Skills",
        "subTitle": [
            {
                "name": "Basic"
            },
            {
                "name": "Front-End Frameworks and Libraries"
            },
            {
                "name": "UI Libraries"
            },
            {
                "name": "CSS Preprocessors and Frameworks"
            },
            {
                "name": "Testing and Version Control Tools"
            },
            {
                "name": "Others"
            }
        ]
    },
    "project": {
        "title": "Projects",
        "content": [
            {
                "name": "Personal Blog",
                "introduce": "Personal introduction and portfolio.",
                "explain": "Created 3D models using Blender and Three.js, and implemented interactive animations through Raycaster.Supports switching between Chinese and English using i18n."
            },
            {
                "name": "Birthday Candle Blowing",
                "introduce": "Built 3D models using Three.js and simulated blowing out candles by detecting sound volume.",
                "explain": "Created 3D models using Blender and Three.js. The candle flame flickers and extinguishes based on the detected sound volume. URL parameters are used to specify the recipient and the gift."
            },
            {
                "name": "Weather Helper",
                "introduce": "A weather query website built with Nuxt3, integrated with the Central Weather Bureau API.",
                "explain": "Used SVG to create a Taiwan map and integrated the Central Weather Bureau API to fetch weather data for each county and city."
            },
            {
                "name": "E-commerce Fashion Website",
                "introduce": "An e-commerce website built with Vue3 and TypeScript, integrated with Firebase for the member system.",
                "explain": "Used Firebase Authentication for the member system, Firestore Database and Storage to store product data and order records."
            },
            {
                "name": "Hotel Booking Website",
                "introduce": "A hotel booking website built with Vue3, integrated with Firebase for the member system.",
                "explain": "Used Firebase Authentication for the member system, Firestore Database and Storage to store order records."
            }
        ]
    }
}